In [1]:
# import pandas
import pandas as pd

I hope you all are familiar with ```Python range()``` function by now. If not here you go.  

The `range()` function returns a sequence of numbers, starting from 0 by default, and increments by 1 (by default), and stops before a specified number.

In [2]:
list(range(21, 15, -2)) # 21, 19, 17

[21, 19, 17]

Let’s now create DataFrame from dictionary in Pandas.

In [70]:
# Create pandas DataFrame
data = {
    "First_name":["Abebe", "Hirut", "Eyob", "Mikaya", "Lij", "Tedy"],  
    "Sequence":range(15, 21),
    "Last_name":["Balcha", "Demse", "Mekonen", "Bahaylu", "Mechael", "Afro"],
    "Range":range(20, 8, - 2)}
df = pd.DataFrame(data)
df.head(10)

  First_name  Sequence Last_name  Range
0      Abebe        15    Balcha     20
1      Hirut        16     Demse     18
2       Eyob        17   Mekonen     16
3     Mikaya        18   Bahaylu     14
4        Lij        19   Mechael     12
5       Tedy        20      Afro     10

In [72]:
cols = ['First_name', 'Last_name', 'Sequence', 'Range']
df_new = df[cols]
df_new

  First_name Last_name  Sequence  Range
0      Abebe    Balcha        15     20
1      Hirut     Demse        16     18
2       Eyob   Mekonen        17     16
3     Mikaya   Bahaylu        18     14
4        Lij   Mechael        19     12
5       Tedy      Afro        20     10

In [71]:
new = df['Sequence']
df.drop('Sequence', axis=1, inplace=True)
# df.insert[2, 'Sequence'] = new
df['Sequence'] = new
df

  First_name Last_name  Range  Sequence
0      Abebe    Balcha     20        15
1      Hirut     Demse     18        16
2       Eyob   Mekonen     16        17
3     Mikaya   Bahaylu     14        18
4        Lij   Mechael     12        19
5       Tedy      Afro     10        20

In [ ]:
# Method 1: drop()
# Mehtod 2: cols=['First_name','Sequence','Last_name']
# df_new = df[cols]

To drop a column, use `drop()` method by providing the `axis=1` if you are trying to drop a column from a DataFrame.

Or yous a `drop(columns='')` if that is easier for you

In [12]:
# Drop variable from DataFrame -->> x3 
df_droped = df.drop('Range', axis=1)
df_droped

  First_name  Sequence Last_name
0      Abebe        15    Balcha
1      Hirut        16     Demse
2       Eyob        17   Mekonen
3     Mikaya        18   Bahaylu
4        Lij        19   Mechael
5       Tedy        20      Afro

In [5]:
df_droped_2 = df.drop(columns='Range')
df_droped_2

  First_name  Sequence Last_name
0      Abebe        15    Balcha
1      Hirut        16     Demse
2       Eyob        17   Mekonen
3     Mikaya        18   Bahaylu
4        Lij        19   Mechael
5       Tedy        20      Afro

In [73]:
# add new column --> x5 
# first let's copy our above dataframe
df_add = df.copy()

# then let's add a new column 
value = ["S", "M", "K", "T", "F", "A"]
df_add['Middle_initials'] = value
df_add
# Abebe Balcha 
#  abebe.balcha@gmail.com

  First_name Last_name  Range  Sequence Middle_initials
0      Abebe    Balcha     20        15               S
1      Hirut     Demse     18        16               M
2       Eyob   Mekonen     16        17               K
3     Mikaya   Bahaylu     14        18               T
4        Lij   Mechael     12        19               F
5       Tedy      Afro     10        20               A

In [79]:
# df_add.at[df['First_name'] == 'Tedy']['Middle_initials'] = ''

In [42]:
df_add['full_name'] = df_add['First_name'] + ' ' + df_add['Last_name']
df_add

  First_name  Sequence Last_name  Range Middle_initials       full_name
0      Abebe        15    Balcha     20               S    Abebe Balcha
1      Hirut        16     Demse     18               M     Hirut Demse
2       Eyob        17   Mekonen     16               K    Eyob Mekonen
3     Mikaya        18   Bahaylu     14               T  Mikaya Bahaylu
4        Lij        19   Mechael     12               F     Lij Mechael
5       Tedy        20      Afro     10               A       Tedy Afro

In [60]:
df_add['email']= df_add['First_name'].str.lower()+ '.' + df_add['Last_name'].str.lower() + '@gmail.com'
# df_add.drop(columns='emial', inplace=True)
# df_add.drop('emial', axis=1)
df_add.drop(index=5) # to remove the 5th index
df_add

KeyError: "['emial'] not found in axis"

In [31]:
# df_test = df_add.copy()
# df_test[df_test['First_name'] == 'Tedy']['Middle_initials'] = ''

/var/folders/q4/y7xqp5c55f3c58vcqh3nb1q80000gn/T/ipykernel_81757/4176094656.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_test[df_test['First_name'] == 'Tedy']['Middle_initials'] = ''

In [32]:
# df_test

  First_name  Sequence Last_name  Range Middle_initials
0      Abebe        15    Balcha     20               S
1      Hirut        16     Demse     18               M
2       Eyob        17   Mekonen     16               K
3     Mikaya        18   Bahaylu     14               T
4        Lij        19   Mechael     12               F
5       Tedy        20      Afro     10               A

In [ ]:
# x1 + x3 
df_add['full_name'] = df_add['First_name'] + ' ' + df_add['Last_name']
df_add

In [ ]:
df_add['sum'] = df_add['Sequence'] + df_add['Range']
df_add

## Breakout 
#### Calculate BMI

```python
data = {
        'name': ['Nati', 'Fikre', 'Zena', 'Hana'],
        'weight': [84, 79, 67, 52],
        'height': [183, 186, 158, 155],
        'smoke_or_not': ['no', 'yes', 'yes', 'no'],
        'email': ['nati@gmail.com', 'fikre@yahoo.com','zena@outlook.com','hana@gmail.com']
        }
  
# Create DataFrame
bmi = pd.DataFrame(data)
bmi
```

Task:
* Create a new column named `BMI` and calculate the body mass index
* Identify customers over `25` bmi
* Draft a sample email noting that there is a new workout routine to help them out. 
* Create a `BMI Categories`: 
* * Underweight = <18.5,
* * Normal weight = 18.5–24.9, 
* * Overweight = 25–29.9, 
* * Obesity = BMI of 30 or greater -- We will do this togather later

## Indexing and selecting data
The axis labeling information in pandas objects serves many purposes:

* Identifies data (i.e. provides metadata) using known indicators, important for analysis, visualization, and interactive console display.  

* Enables automatic and explicit data alignment.  

* Allows intuitive getting and setting of subsets of the data set.

In this section, we will focus on the final point: namely, how to slice, dice, and generally get and set subsets of pandas objects. The primary focus will be on Series and DataFrame as they have received more development attention in this area.

### Different choices for indexing

Read this link: https://pandas.pydata.org/docs/user_guide/indexing.html#different-choices-for-indexing

### 1. Indexing a DataFrame using `.loc[ ]` :
This function selects data by the label of the rows and columns. The df.loc indexer selects data in a different way than just the indexing operator. It can select subsets of rows or columns. It can also simultaneously select subsets of rows and columns.

In [84]:
df_add

  First_name Last_name  Range  Sequence Middle_initials
0      Abebe    Balcha     20        15               S
1      Hirut     Demse     18        16               M
2       Eyob   Mekonen     16        17               K
3     Mikaya   Bahaylu     14        18               T
4        Lij   Mechael     12        19               F
5       Tedy      Afro     10        20               A

In [88]:
cols = ['First_name', 'Last_name']
eyob_lij = df_add.loc[[4,2,0]][cols]
eyob_lij

  First_name Last_name
4        Lij   Mechael
2       Eyob   Mekonen
0      Abebe    Balcha

In [92]:
all_artist = df_add.loc[:,cols]
all_artist

  First_name Last_name
0      Abebe    Balcha
1      Hirut     Demse
2       Eyob   Mekonen
3     Mikaya   Bahaylu
4        Lij   Mechael
5       Tedy      Afro

In [97]:
all_cols = df_add.loc[::3,cols]
all_cols

  First_name Last_name
0      Abebe    Balcha
3     Mikaya   Bahaylu

In [85]:
# retrieving row by loc method
# df.loc[row, column]
# df.iloc[row, column]
item_5th = df_add.loc[5]
item_5th

First_name         Tedy
Last_name          Afro
Range                10
Sequence             20
Middle_initials       A
Name: 5, dtype: object

In [ ]:
# retrieving multiple rows by loc method
item_5th_and_3rd = df_add.loc[[5,3]]
item_5th_and_3rd

In [ ]:
# retrieving two rows and three columns by loc method
cols = ["First_name", "Last_name", "Middle_initials"]
item_by_col= df_add.loc[[5,3]][cols]
item_by_col

In [ ]:
# or 
item_by_col_2 = df_add.loc[[5,3],
                   ["First_name", "Last_name", "Middle_initials"]]
item_by_col_2

In [ ]:
# retrieving all rows and some columns by loc method
all_rows = df_add.loc[:, cols]
all_rows

### 2. Indexing a DataFrame using `.iloc[ ]` :
This function allows us to retrieve rows and columns by position. In order to do that, we’ll need to specify the positions of the rows that we want, and the positions of the columns that we want as well. The df.iloc indexer is very similar to df.loc but only uses integer locations to make its selections.

In [98]:
df_add

  First_name Last_name  Range  Sequence Middle_initials
0      Abebe    Balcha     20        15               S
1      Hirut     Demse     18        16               M
2       Eyob   Mekonen     16        17               K
3     Mikaya   Bahaylu     14        18               T
4        Lij   Mechael     12        19               F
5       Tedy      Afro     10        20               A

In [119]:
result_df = df_add.iloc[1:4,1:4]
result_df

  Last_name  Range  Sequence
1     Demse     18        16
2   Mekonen     16        17
3   Bahaylu     14        18

In [107]:
i_4_r_m = df_add.iloc[4,[2,4]]
i_4_r_m

Range              12
Middle_initials     F
Name: 4, dtype: object

In [109]:
# i_4_r_m = df_add.iloc[5,[4]]
df_add.iloc[5,[4]] = ''
df_add

  First_name Last_name  Range  Sequence Middle_initials
0      Abebe    Balcha     20        15               S
1      Hirut     Demse     18        16               M
2       Eyob   Mekonen     16        17               K
3     Mikaya   Bahaylu     14        18               T
4        Lij   Mechael     12        19               F
5       Tedy      Afro     10        20

In [101]:
# retrieving rows by iloc method 
# df.iloc[row, column] Note both row and column should be intigers 
row2 = df_add.iloc[3]
row2

First_name          Mikaya
Last_name          Bahaylu
Range                   14
Sequence                18
Middle_initials          T
Name: 3, dtype: object

In [106]:
row_3_1 = df_add.iloc[[3,1], 0:2]
row_3_1

  First_name Last_name
3     Mikaya   Bahaylu
1      Hirut     Demse

In [ ]:
# retrieving multiple rows by iloc method 
multiple_rows = df_add.iloc[[3, 5]]
multiple_rows

In [ ]:
# retrieving two rows and two columns by iloc method 
multiple_rows_and_columns = df_add.iloc [[3, 5], [0, 2, 4]]
multiple_rows_and_columns

In [ ]:
# retrieving all rows and some columns by iloc method 
all_rows_and_some_columns = df_add.iloc [:, [0, 2, 4]]
all_rows_and_some_columns

### Update a value by indezing

Let's say `Lij Mechael` want to update his middle initial from 'F' to 'S'

In [ ]:
# let's try to find the the middl name vlaue 
to_update = 'S'
df_add.loc[4,'Middle_initials'] = to_update
df_add

In [ ]:
# Method #2
# opps our mistake.... it should have veen 'Z' not 'S'. let's convert it back
df_add.iloc[4,4] = 'Z'
df_add

In [ ]:
df_add.iloc[3,4] = 'xxx'
df_add

In [ ]:
# df_add['x5'] = 
df_add['x5'] = df_add['x5'].replace('bar','yyy')
df_add

In [ ]:
# I want to get the sum and the x1 value when x5 == 'foo'
# DataFarme[conditon][colums]
df_add[df_add['x5'] == 'foo'][['x1','sum']]

In [ ]:
df_add[(df_add['x5'] == 'foo')==False][['x1','sum']]

In [ ]:
df_add

In [ ]:
# method 2
df_add_2 = df.assign(x5=x5)
df_add_2

In [ ]:
df

In [ ]:
#  [name, email]                [name, address]
#  'sis', 'sis@gmail.com'     ['sisay', '12345 raydale rd']
# [name, email, address]
# 'sisay','sis@gmail.com','12345 raydale rd']

# select table2.name, table1.email, table2.address
# from table1
# join table 2 on tabl1.name = table2.name

In [ ]:
df_add

In [ ]:
df

In [ ]:
# Merge Two pandas DataFrames -- >> df and df_add
df_merge = pd.merge(df[['x3','x4']],  
                      df_add,
                      on = "x3", 
                      how = "outer")
df_merge.head(20)
# left_on = 'x3', right_on = 'x33'

In [ ]:
df_merge.reindex('x3')

In [ ]:
# pervious columns was 
# ['x3','x4_x','x1','x2','x4_y','x5','full_name','sum']

changed_dict = {}
for i in df_merge.columns:
    # if i.__contains__('_'):
    if '_' in i:
        if '_x' in i:
            changed_dict[i] = i.split('_')[0]
        else:
            changed_dict[i] = i.split('_')[0] + '4'

# changed_dict will be like {'x4_x': 'x4', 'x4_y':'x44', 'full_name':'full4'}
df_merge.rename(columns=changed_dict, inplace=True)

# renamed column will have this columns now 
# ['x3', 'x4', 'x1', 'x2', 'x44', 'x5', 'full4', 'sum']

In [ ]:
print(df_merge.columns)

print(df_merge.columns)

In [ ]:
di

In [ ]:
new_list = []
for i in list(range(1,len(df_merge.columns)+1)):
    new_list.append(f'col{i}')

# list(range(1,df_merge.shape[1]+1))

In [ ]:
new_list

In [ ]:
# Create copy of DataFrame
# Use columns attribute to rename columns 
df_renamed = df_merge.copy()
df_renamed.columns = new_list
df_renamed

In [ ]:
# filter certaion rows ==> where x1 == 'x'
# df_filterd =

In [ ]:
# Add new rows to pandas DataFrame
new_row = ['z',33,'s', 44,'f',22,11,'tat']
df_add_new = df_renamed.copy()
df_add_new.loc

In [ ]:
# Append Rows of Two pandas DataFrames

In [ ]:
# Sort Rows of pandas DataFrame

In [ ]:
# Replace Values in pandas DataFrame

In [ ]:
# Replace NaN Values in pandas DataFrame
data_nan = pd.DataFrame({"x1":["x", "x", float('NaN'), "y", float('NaN'), "y"], # Create pandas DataFrame
                         "x2":range(24, 30),
                         "x3":["a", "b", "c", "d", "e", "f"],
                         "x4":range(11, 5, - 1)})

In [ ]:
data_blanks = data_nan.copy()                              # Duplicate data
data_blanks = data_blanks.fillna("")                       # Fill NaN with blanks
print(data_blanks)

### Breakout 
#### Calculate BMI

```python
data = {
        'name': ['Nati', 'Fikre', 'Zena', 'Hana'],
        'weight': [84, 79, 67, 52],
        'height': [183, 186, 158, 155],
        'smoke_or_not': ['no', 'yes', 'yes', 'no']
        }
  
# Create DataFrame
bmi = pd.DataFrame(data)
bmi
```

Task:
* Create a new column named `BMI` and calculate the body mass index
* Identify customers over `25` bmi
* Draft a sample email noting that there is a new workout routine to help them out.